Barira-Sadaf/Landmine-Detection-Robot-Using-STM32/CDAC_FINAL/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define MOTOR_IN___Pin GPIO_PIN_0
#define MOTOR_IN___GPIO_Port GPIOC
#define MOTOR_IN_2_Pin GPIO_PIN_1
#define MOTOR_IN_2_GPIO_Port GPIOC
#define MOTOR_IN_3_Pin GPIO_PIN_2
#define MOTOR_IN_3_GPIO_Port GPIOC
#define MOTOR_IN_4_Pin GPIO_PIN_3
#define MOTOR_IN_4_GPIO_Port GPIOC
#define GSM_tx_Pin GPIO_PIN_2
#define GSM_tx_GPIO_Port GPIOA
#define GSM_rx_Pin GPIO_PIN_3
#define GSM_rx_GPIO_Port GPIOA
#define MOTOR_PWM___Pin GPIO_PIN_1
#define MOTOR_PWM___GPIO_Port GPIOB
#define MOTOR_PWM__E14_Pin GPIO_PIN_14
#define MOTOR_PWM__E14_GPIO_Port GPIOE
#define GPS_tx_Pin GPIO_PIN_10
#define GPS_tx_GPIO_Port GPIOB
#define GPS_rx_Pin GPIO_PIN_11
#define GPS_rx_GPIO_Port GPIOB
#define ULTRA_TRIG_Pin GPIO_PIN_11
#define ULTRA_TRIG_GPIO_Port GPIOD
#define ULTRA_ECHO_Pin GPIO_PIN_12
#define ULTRA_ECHO_GPIO_Port GPIOD
#define ESP_IN_Pin GPIO_PIN_1
#define ESP_IN_GPIO_Port GPIOD
#define MAGNETO_SCL_Pin GPIO_PIN_6
#define MAGNETO_SCL_GPIO_Port GPIOB
#define MAGNETO_SDA_Pin GPIO_PIN_7
#define MAGNETO_SDA_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
